app/Controllers/UserController.php

    public function listUsers()
    {
        // Call user model and fetch all users from users table in database
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`


                // Call user model to save the user in users table in database
                $userModel = new UserModel();
                $userModel->save($post);
---
INSERT INTO `users` (`first_name`, `middle_name`, `last_name`, `age`, `gender_id`, `email`, `password`) VALUES ('Vincent', 'Duron', 'Barrientos', '21', '1', 'vincentbarrientos51@gmail.com', '7110eda4d09e062aa5e4a390b0a572ac0d2c0220')


        // Call gender model and fetch all genders value from genders table in database
        $genderModel = new GenderModel();
        $data['genders'] = $genderModel->findAll();
---
SELECT *
FROM `genders`

    public function delete($id)
    {
        // Select one user
        $userModel = new \App\Models\UserModel();
        $data['user'] = $userModel->find($id);

        // Check if the user exists
        if (!$data['user']) {
            // You can handle the case where the user is not found, e.g., show an error message or redirect to another page.
            return redirect()->to('/user/list')->with('error', 'User not found');
        }

        // Check if the form is submitted and the confirmation is received
        if ($this->request->getMethod() === 'post' && $this->request->getPost('confirm_delete')) {
            // Delete the user from the database using the UserModel's delete method
            $deleted = $userModel->delete($id);
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '8'
DELETE FROM `users`
WHERE `user_id` IN ('8')